
const pashto_locale = {
  name: 'ps',
  rtl: true, // اضافه شده برای راست‌چین شدن تقویم
  months: [
    ['وری', 'ور'],
    ['غویی', 'غو'],
    ['غبرګولی', 'غب'],
    ['چنګاښ', 'چن'],
    ['زمری', 'زم'],
    ['وږی', 'وږ'],
    ['تله', 'تل'],
    ['لړم', 'لړ'],
    ['لېندۍ', 'لې'],
    ['مرغومی', 'مر'],
    ['سلواغه', 'سل'],
    ['کب', 'کب'],
  ],
  weekDays: [
    ['شنبه', 'شنبه'],
    ['یک‌شنبه', 'یک‌شنبه'],
    ['دو‌شنبه', 'دو‌شنبه'],
    ['سه‌شنبه', 'سه‌شنبه'],
    ['چهار‌شنبه', 'چهار‌شنبه'],
    ['پنج‌شنبه', 'پنج‌شنبه'],
    ['جمعه', 'جمعه'],
  ],
  digits: ['۰', '۱', '۲', '۳', '۴', '۵', '۶', '۷', '۸', '۹'],
  meridiem: {
    am: 'سهار',
    pm: 'ماښام',
  },
  ordinal: (number) => number,
}

export default pashto_locale
