import persian_fa from 'react-date-object/locales/persian_fa'

const persian_dari = {
  ...persian_fa,
  name: 'faAf',
  months: [
    ['حمل', 'حم'],
    ['ثور', 'ثو'],
    ['جوزا', 'جو'],
    ['سرطان', 'سر'],
    ['اسد', 'اس'],
    ['سنبله', 'سن'],
    ['میزان', 'می'],
    ['عقرب', 'عق'],
    ['قوس', 'قو'],
    ['جدی', 'جد'],
    ['دلو', 'دل'],
    ['حوت', 'حو'],
  ],
  weekDays: [
    ['جمعه', 'جمعه'],
    ['پنج‌شنبه', 'پنج‌شنبه'],
    ['چهارشنبه', 'چهارشنبه'],
    ['سه‌شنبه', 'سه‌شنبه'],
    ['دوشنبه', 'دوشنبه'],
    ['یک‌شنبه', 'یک‌شنبه'],
    ['شنبه', 'شنبه'],
  ],
  digits: ['۰', '۱', '۲', '۳', '۴', '۵', '۶', '۷', '۸', '۹'],
  meridiem: {
    am: 'قبل‌ازظهر',
    pm: 'بعدازظهر',
  },
  ordinal: (number) => number,
}

export default persian_dari
